package com.example.valentine;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class ShayaniActivity extends AppCompatActivity {

    private RecyclerView recyclerView;
    private ArrayList<ShayarData> list;

    private int cat;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_shayani);

        cat = getIntent().getIntExtra("cat", 1);

        list = new ArrayList<>();

        switch (cat){
            case 1:
                initlist();
                break;
            case 2:
                initlist2();
                break;
            case 3:
                initlist3();
                break;
            case 4:
                initlist4();
                break;
            case 5:
                initlist5();
                break;
            case 6:
                initlist6();
                break;
            case 7:
                initlist7();
                break;
            case 8:
                initlist8();
                break;
        }




        recyclerView = findViewById(R.id.recycler);
        recyclerView.setHasFixedSize(true);
        recyclerView.setLayoutManager(new LinearLayoutManager(this));

        recyclerView.setAdapter(new ShayarAdapter(this,list));

    }



    private void initlist2() {
        list.add(new ShayarData("তুমি আমার শুরু তুমি আমার শেষ\n" +
                "তুমি আমার ভালোবাসার সুখের যত রেশ ।\n" +
                "*** Happy Propose Day ***"));
        list.add(new ShayarData("ভালোবাসা মানে একটা রাত না হয় না ঘুমিয়েই কাটালাম তাতে কি ?\n" +
                "প্রত্যেক প্রহরে আমি তোমার কথা ভেবেই জাগি ।\n" +
                "(( হ্যাপি প্রোপজ ডে ))"));
        list.add(new ShayarData("কখনও কখনও, চিরকালের জন্য প্রিয়জনদের\n" +
                "উপর তোমার সমস্ত ভালবাসা ছড়িয়ে দিতে যথেষ্ট।\n" +
                "Happy propose day"));
        list.add(new ShayarData("আমি তোমাকে অনেক ভালবাসি এবং\n" +
                "চিরকাল তোমাকে চাই তুমি কি আমার হবে."));
        list.add(new ShayarData("আমার ভালবাসা,\n" +
                "তুমি আমার জীবনের প্রতিটি সেকেন্ডকে সুন্দর করেছ।\n" +
                "তুমি কি চিরকাল আমার হাত ধরে রাখবে?"));
        list.add(new ShayarData("আমার অন্য কোনও ভাষার দরকার নেই\n" +
                "কারণ আমার চোখ যা বলেছে তা আমার হৃদয় বলে।\n" +
                "আমি আমার জীবনে সব চাই\n" +
                "আমরা সারা জীবন একসাথে থাকি\n" +
                "আই লাভ ইউ ডিয়ার\n" +
                "Happy propose day!"));
    }

    private void initlist3() {
        list.add(new ShayarData("আজ বিশ্ব চকলেট ডে\n" +
                "তোমার কি মনে আছে ?\n" +
                "মনে যদি নাই থাকে –\n" +
                "এসএমএস দিয়ে জানিয়ে দিলাম তোমাকে ।\n" +
                "@@ হ্যাপি চকলেট ডে @@"));
        list.add(new ShayarData("আজকের এই দিনে\n" +
                "বন্ধু তোমায় পড়ে মনে\n" +
                "চকলেট খেতাম দুজনে\n" +
                "ভাবছি এখন মনে মনে ।\n" +
                "((হ্যাপি চকলেট ডে))"));
        list.add(new ShayarData("তোমার আমার ভালোবাসায় থাকবে শুভ দৃষ্টি\n" +
                "তোমার আমার সম্পর্ক চকলেটের চেয়েও মিষ্টি ।\n" +
                "*** শুভ চকলেট দিবস ***"));
        list.add(new ShayarData("তোমায় আমি এই দিনে কি দেবো উপহার \n" +
                "চকলেট চাড়া আর কিছুই নেই যে আমার ।\n" +
                "সাথে আছে ভালোবাসা দিবে তোমায় সুখ\n" +
                "ভালোবাসার মিষ্টি মুখে ভরে নিও বুক ।\n" +
                "@@@ হ্যাপি চকলেট ডে @@@"));

    }

    private void initlist4() {
        list.add(new ShayarData("আমাকে ভালবাসুন আমার টেডি বিয়ারকে ভালবাসুন\n" +
                "আমাকে চুমু দাও আমাকে আমার টেডি বিয়ার\n" +
                "আমার টেডি বিয়ার আমাকে জড়িয়ে ধরুন\n" +
                "শুভ টেডি বিয়ার ডে"));
        list.add(new ShayarData("তুমি আমার কাঁধে কাঁদো,\n" +
                "যেমন আমার আগের টেডি ছিল।\n" +
                "আশা করি এই টেডি তোমাকে\n" +
                "একইভাবে সহায়তা করবে।\n" +
                "শুভ টেডি দিবস!"));
        list.add(new ShayarData("তুমি আমার ঠোঁটের হাসি,\n" +
                "আমার চোখের পলক,\n" +
                "এবং আমার মুখের আনন্দ,\n" +
                "তুমি ছাড়া আমি কিছুই নই,\n" +
                "আমি আশা করি শীঘ্রই তুমি\n" +
                "আমার সাথে দেখা হবে,\n" +
                "ভালবাসা!শুভ টেডি বিয়ার ডে"));
        list.add(new ShayarData("তুমি টেডি বিয়ারের মতো হাসতে থাকুন\n" +
                "ভাল্লুকের মতো সবসময় হাসি থাকুন\n" +
                "তুমি অন্তরে প্রিয়জনের মতো স্থির হয়েছ\n" +
                "হ্যাপি টেডি বিয়ার মাই প্রিয় তুমি টেডি বিয়ারের মতো হাসতে থাকুন\n" +
                "ভাল্লুকের মতো সবসময় হাসি থাকুন\n" +
                "তুমি অন্তরে প্রিয়জনের মতো স্থির হয়েছ\n" +
                "হ্যাপি টেডি বিয়ার মাই প্রিয়\n" +
                "\n"));
        list.add(new ShayarData("তুমি সর্বদা আমার চিন্তায় থাকেন\n" +
                "এবং আমার স্বপ্নে যেখানেই যেতে পারেন\n" +
                "তুমি টেডি বিয়ার ডেতে সর্বদা\n" +
                "আমার হৃদয়ের কাছাকাছি থাকবেন I\n" +
                "আমি তোমাকে জানার চেয়েও\n" +
                "বেশি ভালবাসি বলতে চাই।\n" +
                "শুভ টেডি বিয়ার ডে"));
        list.add(new ShayarData("আমি যেখানেই যাই বা আমি যা করি তা\n" +
                "নির্বিশেষে তুমি সর্বদা আমার চিন্তা\n" +
                "এবং অন্তরে রয়েছেন।\n" +
                "আমি যা করতে চাই তা হ’ল নরম\n" +
                "এবং মিষ্টি টেডির মতো তোমাকে\n" +
                "যত্ন এবং ভালবাসা। শুভ টেডি দিন!"));
        list.add(new ShayarData("আমি তোমাকে এই টেডি উপহার দিচ্ছি,\n" +
                "যাতে তুমি যখনই এটি দেখেন\n" +
                "তখন তোমাকে আমার স্মরণ করিয়ে দেওয়া হয়।\n" +
                "শুভ টেডি দিবস!"));
        list.add(new ShayarData("তুমি আমার কাঁধে কাঁদো,\n" +
                "যেমন আমার আগের টেডি ছিল।\n" +
                "আশা করি এই টেডি তোমাকে একইভাবে সহায়তা করবে।\n" +
                "শুভ টেডি দিবস!"));
        list.add(new ShayarData("তুমি আমাকে জড়িয়ে ধরতে পারবেন না\n" +
                "তবে তুমি অবশ্যই এই টেডি বিয়ারকে জড়িয়ে ধরতে পারেন\n" +
                "শুভ টেডি দিবস প্রিয়!"));
        list.add(new ShayarData("আমি চাই তুমি আমার পাশেই থাকো\n" +
                "আমার জীবনের প্রতিটি পর্বে আমি তোমাকে\n" +
                "সর্বদা টেডি বিয়ারের মতো আলিঙ্গন করতে চাই।\n" +
                "তাই তোমাকে একটি প্রেরণ, বলার জন্য\n" +
                "শুভ টেডি দিবস!"));
        list.add(new ShayarData("ভালবাসার উষ্ণতা সর্বদা তোমার সাথে থাকুক,\n" +
                "এবং এখানে আমি তোমাকে ভালবাসায় উষ্ণ রাখার\n" +
                "জন্য টেডিটি পাঠাচ্ছি।শুভ টেডি ডে"));
        list.add(new ShayarData("আমি যেখানেই যেতে পারি তুমি\n" +
                "আমার চিন্তায় এবং হৃদয়ে রয়েছেন।\n" +
                "টেডি বিয়ার দিবসে আমি বলতে চাই,\n" +
                "আমি তোমার চেয়ে বেশি যত্নশীল।\n" +
                "শুভ টেডি ডে"));
    }
    private void initlist5() {
        list.add(new ShayarData("কেউ আপনাকে কখনও আঘাত করবে না বলে প্রতিশ্রুতি দিলে কখনও বিশ্বাস করবেন না । মনে রাখবেন, কখনো কেউ এই প্রতিশ্রুতি চিরকাল ধরে রাখতে পারে না ।\n" +
                "— হ্যাপি প্রমিস ডে"));
        list.add(new ShayarData("আমি তোমাকে ভালোবাসার প্রতিজ্ঞা করতে পারি না, তবে ভালো রাখার প্রতিজ্ঞা করতেই পারি ।\n" +
                "— হ্যাপি প্রমিস ডে"));
        list.add(new ShayarData("আমি সবসময় হাসির প্রতিশ্রুতি দিতে পারবো না, কারণ জীবনের কোন না কোন সময়ে মানুষকে কাঁদতে হয়ই ।\n" +
                "— হ্যাপি প্রমিস ডে"));
        list.add(new ShayarData("প্রতিশ্রুতি বিশ্বাসের মতো, এটি রাখতে না পারলে কখনও কারো সাথে প্রতিশ্রুতিবদ্ধ না হওয়াই ভালো ।\n" +
                "— হ্যাপি প্রমিস ডে"));
        list.add(new ShayarData("প্রমিস করে ভালোবাসা হয় না, কারণ ভালোবাসায় কোন শর্ত থাকে না ।\n" +
                "— হ্যাপি প্রমিস ডে"));
        list.add(new ShayarData("কথা দিয়ে কথা না রাখার চেয়ে, কোন প্রমিস না করাই ভালো ।\n" +
                "— হ্যাপি প্রমিস ডে"));
        list.add(new ShayarData("ভালোবাসতে প্রমিস করতে হয় না, ভালোবাসাটাই হলো একটা প্রমিস ।\n" +
                "— হ্যাপি প্রমিস ডে"));
        list.add(new ShayarData("কাউকে এমন কোন বিষয়ে প্রমিস করো না, যে প্রমিস তুমি রাখতে পারবে ।\n" +
                "— হ্যাপি প্রমিস ডে"));
        list.add(new ShayarData("কাউকে এমন কোন আশা দেখাবা না, যে আশা তুমি পুরন করে দিতে পারবে না ।\n" +
                "— হ্যাপি প্রমিস ডে"));
        list.add(new ShayarData("প্রমিস করে কখনো সম্পর্ক টিকে থাকে না, সম্পর্ক টিকে থাকে একের প্রতি অন্যের সহমর্মিতা থেকে ।\n" +
                "— হ্যাপি প্রমিস ডে"));
    }
    private void initlist6() {
        list.add(new ShayarData("Life is a book we all read it. Luv is a blessing we all need it. Always be happy, always have a smile coz. Remember in this world we are just for a while!!!! Happy Kiss Day"));
        list.add(new ShayarData("Why do we close our eyes wen we sleep - wen we dream, wen we kiss? This is becoz the most precious thing in the world is unseen. When i close my eyes i see you!!!! Happy Kiss DAy"));
        list.add(new ShayarData("We cannot be together, But we'll never be apart, For no matter what life brings us, You’re always in my heart....Happy Kiss Day"));
        list.add(new ShayarData("Little keys can open big locks, simple words can express great thoughts. A text from u never fails to make me smile the whole day through. HAppy Kiss Day"));
        list.add(new ShayarData("If I were to describe true luv then I would describe it as what a snowman did to a snowwoman: He gave her warm hug n they both melted in each other’s arms.... Happpy Kiss Day"));
        list.add(new ShayarData("I looked at a sweet, beautiful rose, and then I looked at you, and I kept looking at you, for the rose isn't as beautiful as you. 2...Happy KIss Day"));
        list.add(new ShayarData("Find arms that will hold u at ur weakest, eyes that will c u at ur ugliest, heart that will luv at ur worst, if u hv found it, u've found luv....Happy KIss Day"));

    }
    private void initlist7() {
        list.add(new ShayarData("আমার দিনটি যত খারাপ হোক না কেন,\n" +
                "তোমার হাগ সবকিছুকে এত সুন্দর মনে করে তুলে।\n" +
                "শুভ হাগ দিন আমার ভালবাসা"));
        list.add(new ShayarData("আমরা যতই দূরে থাকি না কেন,\n" +
                "আমি জানি আমি সর্বদা তোমার কাছে ফিরে আসব,\n" +
                "তোমাকে জড়িয়ে ধরব এবং\n" +
                "আমার চুমুতে তোমাকে ঝরনা দেব।খুশি হাগ দিন!\n" +
                "\n"));
        list.add(new ShayarData("আমি তোমাকে শক্ত করে হাগ করতে চাই এবং\n" +
                "তোমাকে নিজের কাছে রাখতে চাই। খুশি হাগ দিন!"));
        list.add(new ShayarData("খুশি হাগ দিন\n" +
                "আমি আশা করি আমি\n" +
                "তোমাকে প্রতিদিন আমার বাহুতে রাখতে পারতাম।"));
        list.add(new ShayarData("আমি কেবলমাত্র আমার পুরো জীবনটি\n" +
                "তোমার বাহুতে কাটানো এবং\n" +
                "তোমার বাহুতে মরতে চাই। খুশি হাগ দিন."));
        list.add(new ShayarData("একটি সুন্দর স্মৃতি এবং চূড়ান্ত ঘনিষ্ঠতা যা ভাগ করে নেয়। খুশি হাগ দিন.\n" +
                "\n"));
        list.add(new ShayarData("তোমার বাহু যেখানে আমি নিরাপদ,\n" +
                "ভালোবাসি এবং শান্তিতে বোধ করি।\n" +
                "আমি তোমার বাহুতে মারা যেতে ইচ্ছুক। খুশি হাগ দিন!"));
        list.add(new ShayarData("আমার জীবনে আসার জন্য\n" +
                "তোমাকে ধন্যবাদ জানাতে একটি গভীর হাগ।\n" +
                "তুমি এটি জীবনযাত্রার মূল্যবান করে তোলেন।\n" +
                "শুভ হাগ দিবস প্রিয় স্ত্রী।"));
        list.add(new ShayarData("আমার দৃষ্টিতে, তুমি এতই সুন্দর\n" +
                "যে তুমি কেবল একটি দিনের জন্যই নয়,\n" +
                "জীবনের প্রতিটি এক দিনের জন্যই হাগের যোগ্য।"));
        list.add(new ShayarData("কখনও কখনও কোনও কারণ ছাড়াই,\n" +
                "হঠাৎ হাগ কারওর জীবন পরিবর্তন করতে পারে।\n" +
                "এবং তুমি আমার। হাজার হাজার মানুষ\n" +
                "আমার কাছ থেকে তোমার প্রিয় বন্ধুকে জড়িয়ে ধরে।\n" +
                "খুশি হাগ দিন!"));
        list.add(new ShayarData("আমি তোমাকে ভালবাসি তুমি যা\n" +
                "করছেন তার জন্য নয়,\n" +
                "আমি যখন তোমার সাথে থাকি\n" +
                "তখন তুমি আমাকে কী করেন\n" +
                "শুভ হাগ দিবস প্রিয়তম!"));
        list.add(new ShayarData("এমনকি একশো মাইল দূরেও,\n" +
                "আমি তোমার চারপাশে তোমার হাত\n" +
                "এবং কাঁধে তোমার উষ্ণ নিঃশ্বাস অনুভব করতে পারি।\n" +
                "খুশি হাগ দিন."));
        list.add(new ShayarData("তোমাকে জড়িয়ে ধরে আমার সমস্ত মানসিক চাপ,\n" +
                "উদ্বেগ দূর করে এবং আমাকে ভালবাসা এবং স্নেহে পূর্ণ করে তোলে।"));
        list.add(new ShayarData("তুমি আমাকে শক্ত করে জড়িয়ে ধরলে আমি\n" +
                "তোমার আত্মার সাথে একটি সংযোগ অনুভব করি।\n" +
                "শুভ হাগ দিবস, প্রিয়।"));
        list.add(new ShayarData("তোমার ছোট ছোট ছোট দুষ্টু জিনিস\n" +
                "তোমার মন খারাপ করে দেয় এবং\n" +
                "আমাকে শক্ত করে জড়িয়ে ধরতে চায়।\n" +
                "আমি আমার দুষ্টু রানী এই বিশেষ দিনে\n" +
                "একটি শক্তিশালী বড় হাগ পাঠাচ্ছি।\n" +
                "শুভ হাগ দিবস\n" +
                "\n"));
        list.add(new ShayarData("তুমি আমাকে জড়িয়ে ধরলে আমার\n" +
                "প্রিয় শব্দটি তোমার হৃদস্পন্দনের শব্দ।\n" +
                "শুভ হাগ দিবস"));
        list.add(new ShayarData("তুমি আমাকে জড়িয়ে ধরলে আমার\n" +
                "প্রিয় শব্দটি তোমার হৃদস্পন্দনের শব্দ।\n" +
                "শুভ হাগ দিবস"));
    }

    private void initlist8() {
        list.add(new ShayarData("তোমাকে ভেবে পৃথিবী আমার অদেখা তবু এঁকে যাই,\n" +
                "আমার ভেতর শুধু তুমি আর তো কিছু পায়নি ঠাই ।\n" +
                "**** হ্যাপি ভ্যালেন্টাইন ডে ****"));
        list.add(new ShayarData("মনের মধ্যে প্রবহমান ঝর্না এনে দিলো ভালোবাসার বন্যা,\n" +
                "ভাসিয়ে নিলো বিস্রিতির ভেলা শুরু হলো ভালোবাসার খেলা ।\n" +
                "((( হ্যাপি ভ্যালেন্টাইন ডে )))"));
        list.add(new ShayarData("তোমার জন্য স্বপ্ন দেখি তুমি আসবে বলে,\n" +
                "তোমার জন্য অপেক্ষায় আছি তুমি\n" +
                "ভালোবাসবে বলে ।\n" +
                "@@@ হ্যাপি ভ্যালেন্টাইন ডে @@@"));
        list.add(new ShayarData("তুমি সন্ধ্যা আকাশের সুখ তারা\n" +
                "রাতের আকাশে জসনা হয়ে দিও আমায় পাহারা\n" +
                "তুমি ভোরের স্নিগ্ধ মাতাল হাওয়া\n" +
                "যার স্পর্শে আমি হয়ে যাই দিশে হারা ।\n" +
                "(( শুভ ভালোবাসা দিবস ))"));
        list.add(new ShayarData("তোমার এক চোখে রোদের আকাশ, অন্য চোখে ছায়া,\n" +
                "তোমার জন্য বুকের ভেতর বাড়ছে শুধু মায়া,\n" +
                "হৃদয় জুড়ে তোমার জন্য স্বপ্ন রাশি রাশি,\n" +
                "আমার চেয়ে তোমায় আমি বেশী ভালোবাসি ।\n" +
                "জানাই ভালোবাসা দিবসের শুভেচ্ছা ।"));
        list.add(new ShayarData("ღ_ღ_ মনেতে আকাশ হয়ে রয়েছো ছড়িয়ে,\n" +
                "বলনা কোথায় রাখি তোমায় লুকিয়ে ।\n" +
                "থাকি যে বিভোর হয়ে শয়নে স্বপনে ॥\n" +
                "যেও না হৃদয় থেকে দূরে হারিয়ে,\n" +
                "আমি যে ভালবাসি শুধু-ই তোমাকে ॥\n" +
                "❃ღღ_Happy Valentines day_ღღ❃"));

        list.add(new ShayarData("ღ_ღ_ একদিন দুজনে হাঁটব আবার উড়বে তোমার চুল,\n" +
                "একদিন শূন্য বাতাস ছুয়ে যাবে কৃষ্ণচুড়ার ফুল…\n" +
                "❃ღღ_Happy Valentines day_ღღ❃\n" +
                "\n"));
        list.add(new ShayarData("নির্জনে বসে আছি একা\n" +
                "বুঝবে তুমি আমরা মনের ব্যাথা\n" +
                "ভালোবাসার অপরাধে হয় যদি ফাঁসি\n" +
                "তবুও বলবো আমি তোমায় ভালোবাসি\n" +
                "** হ্যাপি ভ্যালেন্টাইন ডে **"));
        list.add(new ShayarData("জানিনা আমার এই মন কার জন্য অপেক্ষায় আছে\n" +
                "জানিনা কার মনে আমার জায়গা হবে\n" +
                "শুধু জানি আমার এ মন তার জন্য\n" +
                "যে আমাকে সারা জীবন ভালোবাসবে ।\n" +
                "ভালোবাসা দিবসের শুভেচ্ছা নিও ।"));
        list.add(new ShayarData("তোমার যদি ভালো লাগে ভোরের ওই আকাশ\n" +
                "তবে তুমি সূর মেলাও পাখির মিষ্টি গানে\n" +
                "তোমার যদি ভালো লাগে মেঘলা ওই আকাশ\n" +
                "তবে তুমি মনকে ভাসাও মেঘের ভেলায়\n" +
                "তোমার যদি ভালো লাগে রাতের ওই আকাশ\n" +
                "তবে তুমি হারিয়ে যাও ওই তারার মেলায়\n" +
                "তোমার যদি ভালো লাগে শুধু আমায়\n" +
                "তবে তুমি চুপি চুপি জানিয়ে দিও তোমার ইশারায় ।।\n" +
                "বিশ্ব ভালোবাসা দিবসের শুভেচ্ছা নিও ।\n" +
                "\n"));
        list.add(new ShayarData("স্বপ্ন ভেঙ্গে গেছে তো কি হয়েছে ?\n" +
                "স্বপ্ন আবার দেখো\n" +
                "মনের মানুষ চলে গেছে তো কি হয়ছে ?\n" +
                "মনের দরজা খুলে আবার বসে থাকবো\n" +
                "কেউ না কেউ তো আসবে আমার জীবনে\n" +
                "ভালোবাসার কথা বলবে আমাকে ।"));
        list.add(new ShayarData("ভালোবাসি তোমায় আমি বলবো কতবার\n" +
                "বুঝালেও কেনো বুঝতে চাও না বলো একবার\n" +
                "ভালোবাসি তোমায় আমি আমার জীবনের চেয়ে বেশী\n" +
                "প্লিজ আমাকে বুঝতে চেষ্টা করো জান ।"));

        list.add(new ShayarData("❤❤তোমাকে অনুবাদ করেছি স্বপ্নে তোমাকে অনুবাদ করেছি তৃষ্ণায়?? তোমাকে অনুবাদ করেছি উদাসিনতায়….. ❤❤"));
        list.add(new ShayarData("❤❤চোখের যত কথা ছিল, কেড়েছে শুন্য দৃষ্টি? খুব আদরের শহর ভিজাক, বেহিসেবী বৃষ্টি?❤❤"));
        list.add(new ShayarData("❤❤আমি জানিনা কেন জানিনা, কোন সে মায়াতে পরছি বাধা…. আমি পারিনা আর তো পারিনা, ভুলে থাকতে তোমায় একা…… আমি জানিনা বুঝিনা এটাই কি ভালবাসা ?❤❤"));
        list.add(new ShayarData("Welcome"));
    }

    private void initlist() {
        list.add(new ShayarData("তোমার জীবন হোক গোলাপের মত সুন্দর আর পবিত্র । হ্যাপি রোজ ডে"));
        list.add(new ShayarData("ফুল ভালোবাসার প্রতীক আর গোলাপ হলো পবিত্র ভালোবাসার প্রতীক, তাই আজ world rose day তে তোমাকে জানাই লাল গোলাপের শুভেচ্ছা"));
        list.add(new ShayarData("গোলাপ দেখতে অনেক সুন্দর কিন্তু এতে আছে কাঁটা, তেমনি ভালোবাসা অনেক সুন্দর কিন্তু এর ভিতরে আছে যন্ত্রণা । Happy Rose Day\n" +
                "\n"));
        list.add(new ShayarData("জীবন সুন্দর হয় মানুষকে ভালবাসলে, মানুষকে সাহায্য করলে, পবিত্র ভালোবাসায় সুন্দর হোক সবার জীবন । Happy Rose Day\n" +
                "\n"));
        list.add(new ShayarData("আমার সব ভালোবাসা তোমার জন্য, তাই তুমি আছো আমার হৃদয়ের ফুলদানীতে গোলাপ হয়ে । তোমাকে পেয়ে ধন্য আমার আজকের গোলাপ দিবস । হ্যাপি রোজ ডে ।"));
        list.add(new ShayarData("ফুলে ফুলে সাজিয়ে রেখো তোমার জীবন । সুন্দর স্বপ্নে ভরে থাকুক তোমার জীবন । গোলাপ দিবসে ভরে যাক তোমার মন মিষ্টি ফুলের সুগন্ধে । Happy Rose Day"));
        list.add(new ShayarData("আল্লাহ্\u200Cকে ভালোবাসো পাবে ভরসা\n" +
                "সপ্নকে ভালোবাসো পাবে আশা\n" +
                "মানুষকে ভালোবাসো পাবে ভালোবাসা\n" +
                "গোলাপকে ভালোবাসো পাবে মনের পবিত্রতা\n" +
                "শুভ গোলাপ দিবস\n" +
                "\n"));
        list.add(new ShayarData("ভালোবাসার আহবানে তোমাকে চাই আরো কাছে\n" +
                "সপ্নটা সত্যি হবে তোমাকে কাছে পেলে\n" +
                "জীবন হবে ধন্য তুমি আমার হলে\n" +
                "গোলাপ দিবস ধন্য হবে আমার গোলাপ নিলে\n" +
                "শুভ গোলাপ দিবস\n" +
                "\n"));
    }

}